Revit 2027 API
ParameterTypeId.FabricationSpecification Property
 "Specification"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationSpecification { get; }
Public Shared ReadOnly Property FabricationSpecification As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationSpecification {
	ForgeTypeId^ get ();
}
static member FabricationSpecification : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace